
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.СрокГодности = ТекСтрокаТовары.СрокГодности;
		Движение.ЕдИзм = ТекСтрокаТовары.ЕдИзм;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОснованиеПриИзмененииНаСервере()
    
    // Получаем ссылку на текущий документ "Поступление товаров"
    ТекущееПоступление = ЭтотОбъект;
    
    // Получаем ссылку на документ "Заказ поставщику", который является основанием для создания поступления
		ОснованиеЗаказ = ТекущееПоступление.Основание;
         
    
    // Проверяем, что основание установлено и является документом "Заказ поставщику"
    Если ТипЗнч(ОснованиеЗаказ) = Тип("Документ.ЗаказПоставщику") Тогда
        // Получаем данные из документа "Заказ поставщику"
        ТоварыЗаказа = ОснованиеЗаказ.Товары;
        
        // Очищаем таблицу "Товары по факту" в текущем документе
        ТекущееПоступление.ТоварыПоФакту.Очистить();
        
        // Заполняем таблицу ТоварыПоФакту на основе товаров из заказа
        Для Каждого Товар Из ТоварыЗаказа Цикл
            // Создаем новую строку в таблице "Товары по факту" текущего поступления
            НоваяСтрока = ТекущееПоступление.ТоварыПоФакту.Добавить();
            
            // Заполняем информацию о товаре из заказа
            НоваяСтрока.Товар = ТоварыЗаказа.Товар;  
			НоваяСтрока.ВидТовара = ТоварыЗаказа.ВидТовара;
            НоваяСтрока.Количество = ТоварыЗаказа.Количество;
            НоваяСтрока.ЕдИзм = ТоварыЗаказа.ЕдИзм;

			
        КонецЦикла;
    КонецЕсли;
    
КонецПроцедуры

